using p3rpc.commonmodutils;
using p3rpc.nativetypes.Interfaces;
using p3rpc.slplus.Hooking;
using p3rpc.slplus.Interfaces;
using p3rpc.slplus.Messages;
using Reloaded.Hooks.Definitions;
using Reloaded.Hooks.Definitions.Enums;
using Reloaded.Hooks.Definitions.X64;
using System.Runtime.InteropServices;
using static p3rpc.slplus.Messages.MessageHooks;
using static p3rpc.slplus.SocialLink.SocialLinkManager;
using static Reloaded.Hooks.Definitions.X64.FunctionAttribute;

namespace p3rpc.slplus.SocialLink
{
    public class CommuListColors : ICommuListColors
    {
        public static readonly ConfigColor DarkColorDefault = new ConfigColor(0xe, 0xe, 0x54, 0xff);
        public static readonly ConfigColor LightColorDefault = new ConfigColor(0x72, 0xff, 0xff, 0xff);
        public static readonly ConfigColor Red = new ConfigColor(0xff, 0x0, 0x0, 0xff);
        public static readonly ConfigColor defaultDetailsBgBox = new ConfigColor(0x0, 0x1, 0x58, 0xff);
        public static readonly ConfigColor defaultDetailsNameplateTriangle = new ConfigColor(0x6, 0x0, 0xfd, 0xff);
        public static readonly ConfigColor defaultDetailsNameSprite = new ConfigColor(0xe, 0xe2, 0xf8, 0xff);
        public ConfigColor BgColorNormal { get; private set; } = DarkColorDefault;
        public ConfigColor BgColorSelected { get; private set; } = ConfigColor.White;
        // public FSprColor BgColorReverse { get; set; } = new FSprColor(0x0, 0x0, 0x0, 0xff); (Not implemented in P3RE)

                    $"{_context._hooks.Utilities.GetAbsoluteCallMnemonics(AUICmpCommu_SocialLinkDetailsDrawHeaderArcanaImpl, out _drawHeaderArcanaWrapper)}",
                };
                _drawHeaderArcana = _context._hooks.CreateAsmHook(function, addr, AsmHookBehaviour.ExecuteFirst).Activate();
            });
            _context._utils.SigScan(AUIDrawBaseActor_DrawTriangle_SIG, "AUIDrawBaseActor::DrawTriangle", _context._utils.GetDirectAddress, 
                addr => _drawTriangle = _context._utils.MakeWrapper<AUIDrawBaseActor_DrawTriangle>(addr));
            _context._utils.SigScan(SetPresetBlendState_140cc8540_SIG, "SetPresetBlendState::140cc8540", _context._utils.GetDirectAddress, 
                addr => _setPresetBlendState = _context._utils.MakeWrapper<SetPresetBlendState_140cc8540>(addr));
            _context._utils.SigScan(UCmpCommu_DetailsDrawPortrait_SIG, "UCmpCommu::DetailsDrawPortrait", _context._utils.GetDirectAddress, 
                addr => _detailsDrawPortrait = _context._utils.MakeHooker<UCmpCommu_DetailsDrawPortrait>(UCmpCommu_DetailsDrawPortraitImpl, addr));
            _context._utils.SigScan(DrawTexture_SIG, "DrawTexture", _context._utils.GetIndirectAddressShort, 
                addr => _drawTexture = _context._utils.MakeWrapper<DrawTexture>(addr));
            _context._utils.SigScan(UCmmProfileDataAsset_GetBmdProfilePage_SIG, "UCmmProfileDataAsset::GetBmdProfilePage", _context._utils.GetDirectAddress,
                addr => _getBmdProfilePage = _context._utils.MakeWrapper<UCmmProfileDataAsset_GetBmdProfilePage>(addr));

            cmmListEntryPoints = (FVector2D*)NativeMemory.Alloc((nuint)sizeof(FVector2D) * 4);
            // Cmm entry blocks
            cmmListEntryPoints[0].X = -303.0f;
            cmmListEntryPoints[0].Y = -68.0f;
            cmmListEntryPoints[1].X = 280.0f;
            cmmListEntryPoints[1].Y = -68.0f;
            cmmListEntryPoints[2].X = -280.0f;
            cmmListEntryPoints[2].Y = 69.0f;
            cmmListEntryPoints[3].X = 303.0f;
            cmmListEntryPoints[3].Y = 69.0f;
            // Scrollbar track
            cmmListEntryPointsScrollTrack = (FVector2D*)NativeMemory.Alloc((nuint)sizeof(FVector2D) * 4);
            cmmListEntryPointsScrollTrack[0].X = -6.0f;
            cmmListEntryPointsScrollTrack[0].Y = -6.0f;
            cmmListEntryPointsScrollTrack[1].X = 17.0f;
            cmmListEntryPointsScrollTrack[1].Y = -6.0f;
            cmmListEntryPointsScrollTrack[2].X = 28.0f;
            cmmListEntryPointsScrollTrack[2].Y = 202.0f;
            cmmListEntryPointsScrollTrack[3].X = 51.0f;
            cmmListEntryPointsScrollTrack[3].Y = 202.0f;
        }
        public override void Register()
        {
            _manager = GetModule<SocialLinkManager>();
            _utils = GetModule<SocialLinkUtilities>();
            _common = GetModule<CommonHooks>();
            _msgHook = GetModule<MessageHooks>();
        }

        [StructLayout(LayoutKind.Explicit, Size = 0xa0)]
        public unsafe struct UCmpCommuListVisibleEntries
        {
            [FieldOffset(0x0)] public uint Flags;
            [FieldOffset(0x28)] public float Opacity;
            [FieldOffset(0x34)] public float Field34;
            [FieldOffset(0x38)] public float Field38;
        }

        [StructLayout(LayoutKind.Explicit, Size = 0x50)]
        public unsafe struct CmpCommuMenu
        {
            [FieldOffset(0x4)] public int EntryCount;
            [FieldOffset(0x8)] public int EntriesVisibleAtOnce;
            [FieldOffset(0x24)] public int VisibleEntryOffset;
            [FieldOffset(0x28)] public int ScrollEntryOffset;
        }

        [StructLayout(LayoutKind.Explicit, Size = 0x478)]
        public unsafe struct AUICmpCommu
        {
            [FieldOffset(0x0000)] public AUIBaseActor baseObj;
            [FieldOffset(0x288)] public int Field288;
            //[FieldOffset(0x0408)] public UUISceneFSM* SceneFSM_;
            [FieldOffset(0x0410)] public UCmpCommuList* CommuListScene_;
            [FieldOffset(0x0418)] public UCmpCommuDetails* CommuDetailsScene_;
            [FieldOffset(0x420)] public long UnlockedCount;
            [FieldOffset(0x428)] public TArray<nint> UnlockedCmmEntries;
            [FieldOffset(0x438)] public TArray<nint> CmmEntries2;
            [FieldOffset(0x448)] public CmpCommuMenu* Menu;
            [FieldOffset(0x0458)] public ACmpMainActor* pMainActor;
            [FieldOffset(0x0460)] public UCmpCommu* pParent;
            //[FieldOffset(0x0468)] public ACmpCommuModelController* pModelController;
        }

        [StructLayout(LayoutKind.Explicit, Size = 0x550)]
        public unsafe struct UCmpCommuList
        {
            //[FieldOffset(0x0000)] public UUIScene baseObj;
            [FieldOffset(0xa8)] public FVector2D CursorOffsetTemp;
            [FieldOffset(0x148)] public FVector2D CursorOffsetPermanent;
            // [FieldOffset(0x1a0)] public UCmpCommuListVisibleEntries VisibleEntries[5];
            [FieldOffset(0x04C0)] public AUICmpCommu* Context_;
            [FieldOffset(0x04C8)] public AUICmpCommu* pParent;
            [FieldOffset(0x04D0)] public ACmpMainActor* pMainActor;

            public UCmpCommuListVisibleEntries* GetListVisibleEntry(int id)
            {
                if (id < 0 || id > 4) return null;
                fixed (UCmpCommuList* self = &this) { return &((UCmpCommuListVisibleEntries*)((nint)self + 0x1a0))[id]; }
            }
        }

        // also used in p3rpc research
        [StructLayout(LayoutKind.Explicit, Size = 0xa4)]
        public unsafe struct TextData
        {
            [FieldOffset(0x0)] public FVector Position;
            [FieldOffset(0xc)] public FSprColor Color;
            [FieldOffset(0x10)] public float Size;
            [FieldOffset(0x18)] public FString Text;
            [FieldOffset(0x2c)] public FVector BasePosition;
            [FieldOffset(0x38)] public float BaseSize;
            [FieldOffset(0x40)] public float Angle;
            [FieldOffset(0x60)] public FVector4 TransformMatrixRow0;
            [FieldOffset(0x70)] public FVector4 TransformMatrixRow1;
            [FieldOffset(0x80)] public FVector4 TransformMatrixRow2;
            [FieldOffset(0x90)] public FVector4 TransformMatrixRow3;
            [FieldOffset(0xa0)] public int FieldA0;

            public TextData(FVector position, FSprColor color, float size, FString text)
            {
                Position = position;
                Color = color;
                Size = size;
                Text = text;
                BasePosition = new FVector(0, 0, 0);
                BaseSize = 1;
                Angle = 0;
                TransformMatrixRow0 = new FVector4(1, 0, 0, 0);
                TransformMatrixRow1 = new FVector4(0, 1, 0, 0);
                TransformMatrixRow2 = new FVector4(0, 0, 1, 0);
                TransformMatrixRow3 = new FVector4(0, 0, 0, 1);
                FieldA0 = 1;
            }
        }

        [StructLayout(LayoutKind.Explicit, Size = 0x968)]
        public unsafe struct UCmpCommuDetails
        {
            //[FieldOffset(0x0000)] public UUIScene baseObj;
            [FieldOffset(0x40)] public BPDrawSpr Drawer;
            [FieldOffset(0x0060)] public AUICmpCommu* Context_;
            [FieldOffset(0x68)] public CmpCommuMenu* Menu;
            [FieldOffset(0x78)] public TArray<FCommunityFormattedName> FormattedNames;
            [FieldOffset(0x1fc)] public float Field1FC;
            [FieldOffset(0x47c)] public float CharDetailBgOffsetX;
            [FieldOffset(0x08B0)] public AUICmpCommu* pParent;
            [FieldOffset(0x08B8)] public ACmpMainActor* pMainActor;
        }

        [StructLayout(LayoutKind.Explicit, Size = 0x2A0)]
        public unsafe struct AAppPropsCore
        {
            [FieldOffset(0x0000)] public AAppActor baseObj;
            [FieldOffset(0x0278)] public FName mOnFlagName_;
            [FieldOffset(0x0280)] public FName mOffFlagName_;
            //[FieldOffset(0x0288)] public USceneComponent* Root;
            //[FieldOffset(0x0290)] public USkeletalMeshComponent* SkeletalMesh;
            //[FieldOffset(0x0298)] public UAppPropsAnimPackAsset* mAnimePackAsset_;
        }

        public enum EAppPropsCardType
        {
            Blank = 0,
            Persona = 1,
            MajorArcana = 2,
            MinorArcana = 3,
        };


        [StructLayout(LayoutKind.Explicit, Size = 0xC)]
        public unsafe struct FAppPropsCardParam
        {
            [FieldOffset(0x0000)] public EAppPropsCardType Type;
            [FieldOffset(0x0004)] public int ID;
            [FieldOffset(0x0008)] public int Rank;
        }

        [StructLayout(LayoutKind.Explicit, Size = 0x18)]
        public unsafe struct FAppPropsCardData
        {
            [FieldOffset(0x0000)] public FAppPropsCardParam Param;
            [FieldOffset(0x0010)] public AAppPropsCore* Card;
        }

        [StructLayout(LayoutKind.Explicit, Size = 0x2B0)]
        public unsafe struct AAppPropsCardContainer
        {
            [FieldOffset(0x0000)] public AAppActor baseObj;
            [FieldOffset(0x0278)] public UAssetLoader* Loader;
            [FieldOffset(0x0288)] public TArray<FAppPropsCardData> CardList;
            [FieldOffset(0x0298)] public UClass* PersonaCardClass; // TSubclassOf<AAppPropsCore>
            [FieldOffset(0x02A0)] public UClass* MajorCardClass; // TSubclassOf<AAppPropsCore>
            [FieldOffset(0x02A8)] public UClass* MinorCardClass; // TSubclassOf<AAppPropsCore>
        }


        [StructLayout(LayoutKind.Explicit, Size = 0x2E8)]
        public unsafe struct ACmpCommuModelController
        {
            [FieldOffset(0x0000)] public AAppActor baseObj;
            [FieldOffset(0x2a0)] public TArray<ArcanaCardIdTex> ArcanaCardId;
            [FieldOffset(0x02B0)] public ACmpMainActor* pMainActor;
            [FieldOffset(0x02B8)] public AAppPropsCardContainer* pCardContainer;
            [FieldOffset(0x02C0)] public AAppPropsCore* pCardBp;
            [FieldOffset(0x02C8)] public TArray<IntPtr> pTextures;
            [FieldOffset(0x02D8)] public TArray<IntPtr> pMotions;
        }

        [StructLayout(LayoutKind.Explicit, Size = 0xC60)]
        public unsafe struct UCmpCommu
        {
            [FieldOffset(0x0000)] public UCmpMenuBase baseObj;
            [FieldOffset(0x38)] public BPDrawSpr drawer;
            [FieldOffset(0x48)] public int MenuSelected;
            [FieldOffset(0x4c)] public int MenuState;
            [FieldOffset(0x58)] public byte bIsInitialized;
            [FieldOffset(0x0060)] public UTexture2D* pCommuBustupAry;
            [FieldOffset(0x0C48)] public UAssetLoader* AssetLoader_;
            [FieldOffset(0x0C50)] public AUICmpCommu* Actor_;
            [FieldOffset(0x0C58)] public ACmpCommuModelController* pModelController;

            public UTexture2D* GetCustomSlPortrait(int cmmId)
            {
                fixed (UCmpCommu* self = &this)
                {
                    return ((UCmpCommuExtendedEntry*)(self + 1))[cmmId - vanillaCmmLimit - 1].BustupTex;
                    //return *(UTexture2D**)((nint)(self + 1) + (cmmId - SocialLinkManager.vanillaCmmLimit - 1) * 8);
                }
            }

            public UCmpCommuExtendedEntry* GetExtendedCmmEntry(int cmmId)
            {
                fixed (UCmpCommu* self = &this)
                {
                    return &((UCmpCommuExtendedEntry*)(self + 1))[cmmId - vanillaCmmLimit - 1];
                }
            }
        }
        [StructLayout(LayoutKind.Explicit, Size = 0x8)]
        public unsafe struct ArcanaCardIdTex
        {
            [FieldOffset(0x0)] public int ArcanaId;
            [FieldOffset(0x4)] public int Field04;
        }

        public enum ECmmProfileMsgType
        {
            Normal = 0,
            Reverse = 1,
            Missing = 2,
            Lost = 3,
        };

        [StructLayout(LayoutKind.Explicit, Size = 0x60)]
        public unsafe struct FCmmProfileItem
        {
            [FieldOffset(0x0000)] public ushort PCID;
            [FieldOffset(0x0004)] public uint DisappearID;
            [FieldOffset(0x0008)] public int NameMsgNo;
            //[FieldOffset(0x0010)] public TMap<ECmmProfileMsgType, int> ProfileMsgNo;
        }

        [StructLayout(LayoutKind.Explicit, Size = 0x80)]
        public unsafe struct UCmmProfileDataAsset
        {
            //[FieldOffset(0x0000)] public UAppDataAsset baseObj;
            [FieldOffset(0x0030)] public TMap<ushort, FCmmProfileItem> Data;
        }
        private unsafe uint GetArcanaNumberSprId(int arcanaId) 
        {
            if (_manager.cmmIndexToSlHash.TryGetValue(arcanaId, out var arcanaHash) &&
                _manager.activeSocialLinks.TryGetValue(arcanaHash, out var customSl))
                return 0x2d4 + (uint)customSl.ArcanaId;
            else return (arcanaId <= SocialLinkManager.vanillaCmmLimit) ? 0x2d4 + (uint)arcanaId : 0x2d4;
        }
        // NOTE: input is zero indexed
        private unsafe uint GetArcanaNameSprId(int arcanaId)
        {
            if (_manager.cmmIndexToSlHash.TryGetValue(arcanaId, out var arcanaHash) &&
                _manager.activeSocialLinks.TryGetValue(arcanaHash, out var customSl))
                return 0x2f2 + (uint)customSl.ArcanaId;
            else return (arcanaId <= SocialLinkManager.vanillaCmmLimit) ? 0x2f2 + (uint)arcanaId : 0x2f2;
        }
